apo=int(input('Δώσε έτος έναρξης:'))
eos=int(input('Δώσε έτος λήξης:'))
for e in range(apo,eos+1):
    a=e%19
    b=e%4
    g=e%7
    d=(19*a+16)%30
    z=(2*b+4*g+6*d)%7
    if (e%4==0 and e%100!=0) or e%400==0:
        f=1
    else:
        f=0
    ap=d+z+f+13;
    if f==1:
        if ap<=29:
            print('Οι απόκριες του',e,'είναι στις',ap,'Φεβρουαρίου')
        else:
            print('Οι απόκριες του',e,'είναι στις',ap-29,'Μαρτίου')
    else:
        if ap<=28:
            print('Οι απόκριες του',e,'είναι στις',ap,'Φεβρουαρίου')
        else:
            print('Οι απόκριες του',e,'είναι στις',ap-28,'Μαρτίου')
    
