# Τρίτη εναλλακτική λύση της άσκησης 5.22 με χρήση λίστας από πλειάδες

oles_oi_omades=(
                ('Μανώλης','Ελένη','Δέσποινα'),
                ('Νίκος','Χρυσάνθη','Μιχαήλ'),
                ('Βασίλης','Μάξιμος','Άρτεμις','Μαρία')
                )

onom=input('Δώσε το όνομά σου :')

if onom in oles_oi_omades[0]:
    print('Ανήκεις στην ομάδα Α')
elif onom in oles_oi_omades[1]:
    print('Ανήκεις στην ομάδα B')
elif onom in oles_oi_omades[2]:
    print('Ανήκεις στην ομάδα Γ')
else:
    print('Δεν ανήκεις σε καμία ομάδα')


	














