aei=('Πανεπιστήμιο Αιγαίου','ΕΜΠ','ΑΠΘ','Πολυτεχνείο Κρήτης')
tmima=('Θάλλασας','Γεωγραφίας','Περιβάλλοντος','Πολιτισμικής')
a=input('Δώσε ΑΕΙ :')
if a in aei:
    if a==aei[0]:
        t=input('Δώσε τμήμα :')
        if t in tmima:
            if t==tmima[3]:
                print('είσαι δικός μας')
        else:
            print('Δεν υπάρχει τέτοιo τμήμα στο',a)
    else:
        print('Δεν ανήκεις στο',aei[0],'αλλά και το',a,'καλό είναι')
else:
    print('Δεν γνωρίζω το ίδρυμα')


	














