# Καθολικός χώρος ονομάτων
global_var = 'Μεταβλητή στον καθολικό χώρο ονομάτων'

def perivalousa():
    # Περιβάλλων χώρος ονομάτων
    enclosing_var = 'Μεταβλητή στον περιβάλλοντα χώρο ονομάτων'
    
    def esoteriki():
        # Τοπικός χώρος ονομάτων
        local_var = 'Μεταβλητή στον τοπικό χώρο ονομάτων'
        # Πρόσβαση στις μεταβλητής διαφορετικών χώρων ονομάτων
        print('Μέσα στην εσωτερική συνάρτηση')
        print('local_var:', local_var)  # Τοπική μεταβλητή
        print('enclosing_var:', enclosing_var)  # Μεταβλητή περιβάλλοντα χώρου
        print('global_var:', global_var)  # Καθολική μεταβλητή
        print('-----------------------')
    esoteriki() # Κλήση της εσωτερικής συνάρτησης μέσα από την παριβάλλουσα

# Πρόσβαση μόνο σε καθολικές και build-in οντότητες
perivalousa() # Κλήση της παριβάλλουσας συνάρτησης
print('Έξω από κάθε συνάρτηση')
print('global_var:', global_var)  # Καθολική μεταβλητή
Python_kai_xero_psomi=True
