# Θέση ποντικιού
ar=int(input('Δώσε τον αριθμό από το ποντίκι:'))
kat_pos=ar&255	        # Υπολογισμός της κατακόρυφης θέσης
or_pos=(ar&65280)>>8	# Υπολογισμός της οριζόντιας θέσης
pliktra=(ar&196608)>>16	# Υπολογισμός της κατάστασης των πλήκτρων
# Εμφάνιση της θέσης του ίχνους του ποντικιού
print('Κατακόρυφη θέση: ',kat_pos)
print('Οριζόντια θέση: ',or_pos)
if pliktra==0:
    print('Κανένα πατημένο πλήκτρο')
elif pliktra==1: 
    print('Πατημένο το δεξιό πλήκτρο')
elif pliktra==2:
    print('Πατημένο το αριστερό πλήκτρο')
elif pliktra==3: 
    print('Πατημένα και τα δύο πλήκτρα')
 




