'''
    Παραδείγματα μετατροπών δυαδικού-δεκαδικού-δεκαεξαδικού
    Οι δυαδικοί και οι δεκαεξαδικοί μπορούν να παρασταθούν με διάφορες μορφές.
    Μελετήστε τις παραγράφους: 
        3.8 Οι συναρτήσεις int(), float(), str() και bool() 
        10.2 Η µέθοδος format() 
        10.6 Bytes και bytearray
        Η συνάρτηση int() δέχεται και άλλες παραμέτρους που δεν αναφέρονται στο βιβλίο.
        Στα παραδείγματα χρησιμοποιείται με ακόμα μια παράμετρος. 
        Αναζητήστε πληροφορίες στο δυαδίκτυο ή μαντέψτε σε τι αναφέρεται βλέποντας τα παραδείγματα.    
'''
print('1. Ο {} είναι {} και εκτυπώθηκε ως δυαδικός: {:b}'.format(130,type(130),130))
print('2. Ο {} μετατράπηκε απο {} στον δεκαδικό αριθμό {}'.format(b'10000010',type(b'10000010'),int(b'10000010',2)))
print('3. Ο {} μετατράπηκε απο {} στον δεκαδικό αριθμό {} '.format('10000010',type('10000010'),int('10000010',2)))
print('4. Ο {} μετατράπηκε απο {} στον δεκαδικό αριθμό {}'.format('0b10000010',type('0b10000010'),int('0b10000010',2)))
print('5. Χρήση της bin: Ο {} μετατράπηκε απο {} στον δεκαδικό αριθμό {}'.format(bin(130),type(bin(130)),int(bin(130),2)))
print('6. Ο {} μετατράπηκε απο {} σε class bytes (δεκαεξαδική μορφή){} '.format(130,type(130),int.to_bytes(130,2,'big')))
print('7. Ο {} μετατράπηκε (ερμηνεύτηκε σαν big) απο {} στον δεκαδικό {} '.format(b'\x00\x82',type(b'\x00\x82'),int.from_bytes(b'\x00\x82','big')))
print('\t Δηλαδή: {:08b} {:08b} '.format(int.from_bytes(b'\x00'), int.from_bytes(b'\x82')))
print('8. Ο {} μετατράπηκε (ερμηνεύτηκε ως little) απο {} στον δεκαδικό {} '.format(b'\x00\x82',type(b'\x00\x82'),int.from_bytes(b'\x00\x82','little')))
print('\t Δηλαδή: {:08b} {:08b} '.format(int.from_bytes(b'\x82'), int.from_bytes(b'\x00')))

print('---')
print('1a. Ο {} είναι {} και εκτυπώθηκε ως δεκαεξαδικός: {:X}'.format(241,type(241),241))
print('2a. Ο {} μετατράπηκε απο {} στον δεκαδικό αριθμό {} '.format('F1',type('F1'),int('F1',16)))
print('3a. Ο {} μετατράπηκε απο {} στον δεκαδικό αριθμό {} '.format('0xF1',type('0xF1'),int('0xF1',16)))
print('4a.')
print('5a. Ο {} μετατράπηκε απο {} στον δεκαδικό αριθμό {}'.format(hex(241),type(hex(241)),int(hex(241),16)))
print('6a. Ο {} μετατράπηκε απο {} σε class bytes (δεκαεξαδική μορφή){} '.format(241,type(241),int.to_bytes(241,2,'big')))

