def emvado_p(x,y):
    return x*y

def emvado_k(r):
    return 3.14*r**2

# Οι μεταβλητές στις οποίες αποθηκεύονται τα μήκη των πλευρών των παραλληλογράμμων
p1a=10
p1b=5
p2a=7
p2b=8
# Οι μεταβλητές στις οποίες αποθηκεύονται τα μήκη των ακτίνων των κύκλων
k1r=4
k2r=5
# Αποθήκευση των χρωμάτων των σχημάτων      
p1xr="Πράσινο"
p2xr="Κόκκινο"
k1xr="Γαλάζιο"
k2xr="Κίτρινο"
p1emv=emvado_p(p1a,p1b)  # Υπολογισμός του εμβαδού του ενός παραλληλογράμμου 
k2emv=emvado_k(k2r)      # Υπολογισμός του εμβαδού του ενός κύκλου
# Εμφανίζει τα στοιχεία του πρώτου παραλληλογράμμου
print('Ορθογώνιο ',p1xr,' ',p1a,'x',p1b,' E=',p1emv) 
# Εμφανίζει τα στοιχεία του δεύτερου κύκλου
print('Κύκλος ',k2xr,' R=',k2r,' E=',k2emv) 
 
